%方程f(x)=x^4-8*x^3-6*x^2-16*x+4
a=2;  %给定初始搜索区间[a,b]
b=10;
e=1.0e-10;  %控制误差
r=[];   %迭代次数存储数组
q=[];  %每次迭代所得函数值存储数组
k=0;  %迭代次数初始置零
y1=0;  %这里给定的y1与y2无实际意义，只为下面循环的开始设定初始启动量
y2=1;
while abs((b-a)/b)>=e&&abs((y2-y1)/y2)>=e
    c=(a+b)/2;
    x=c;
    q=[q,x];
    r=[r,k];
    f1=4*c^3-24*c^2-12*c-16;
    if f1==0
        x=c;
        break
    end
    if f1>0
        b=c;
        y1=a^4-8*a^3-6*a^2-16*a+4;
        y2=b^4-8*b^3-6*b^2-16*b+4;
    else
        a=c;
        y1=a^4-8*a^3-6*a^2-16*a+4;
        y2=b^4-8*b^3-6*b^2-16*b+4;
    end
    k=k+1;
end
plot(r,q)  %作出迭代次数和目标函数值的关系曲线
x
k=k-1
f=x^4-8*x^3-6*x^2-16*x+4