%方程f(x)=x^4-8*x^3-6*x^2-16*x+4
a=2;  %给定初始搜索区间[a,b]
b=10;
e=1.0e-10;  %控制误差
r=[];   %迭代次数存储数组
q=[];  %每次迭代所得函数值存储数组
k=0;  %迭代次数初始置零
p=0.618;
a1=b-p*(b-a);
y1=a1^4-8*a1^3-6*a1^2-16*a1+4;
a2=a+p*(b-a);
y2=a2^4-8*a2^3-6*a2^2-16*a2+4;
while abs((b-a)/b)>=e&&abs((y2-y1)/y2)>=e
    x=(a+b)/2;
    q=[q,x];
    r=[r,k];
    if y1>=y2
        a=a1;
        a1=a2;
        y1=y2;
        a2=a+p*(b-a);
        y2=a2^4-8*a2^3-6*a2^2-16*a2+4;
    else
        b=a2;
        a2=a1;
        y2=y1;
        a1=b-p*(b-a);
        y1=a1^4-8*a1^3-6*a1^2-16*a1+4;
    end
    k=k+1;
end
plot(r,q)   %作出迭代次数和目标函数值的关系曲线
x
k=k-1
f=x^4-8*x^3-6*x^2-16*x+4